#### Pandas
* csv file read

In [9]:
import pandas as pd
df = pd.read_csv('data\hotel.csv', index_col=0)
#cp949

##### index_col=0
index_col → '호텔1~20'이 index가 아니기 때문에 index는 0이라는 걸 가르쳐 주는 것

In [10]:
df.head()

      grade  rate  price
호텔1      10     1   9500
호텔2       8     3   8000
호텔3       2     5   6000
호텔4       3     4   2000
호텔5       5     3   4000

In [11]:
df['grade'].unique()

array([10,  8,  2,  3,  5,  9,  1,  4,  7], dtype=int64)

In [12]:
df['grade'].value_counts().sort_index()

grade
1     1
2     3
3     3
4     1
5     3
7     1
8     2
9     4
10    2
Name: count, dtype: int64

##### GroupBy 
* by를 기준으로 그룹핑

In [14]:
newDf = df.groupby('grade')

In [15]:
newDf.sum()[['price']]

       price
grade
1       1000
2      19400
3      11000
4       2400
5       9700
7       6400
8      16900
9      24900
10     14700

In [16]:
newDf.mean([['price']])

       rate        price
grade
1       4.0  1000.000000
2       3.0  6466.666667
3       4.0  3666.666667
4       5.0  2400.000000
5       2.0  3233.333333
7       4.0  6400.000000
8       3.5  8450.000000
9       3.0  6225.000000
10      1.5  7350.000000

In [17]:
newDf.max([['price']])

       rate  price
grade
1         4   1000
2         5   8900
3         5   7000
4         5   2400
5         3   4000
7         4   6400
8         4   8900
9         4   8000
10        2   9500

In [18]:
newDf.count()[['price']]

       price
grade
1          1
2          3
3          3
4          1
5          3
7          1
8          2
9          4
10         2

.agg 
* sum, mean, count 값을 한 번에 출력 
coulumn 지정 가능 
* .culums=['name1','name2','name3']